Return a copy of an object derived from LightDistribution
  Namespace:   Autodesk.Revit.DB.Lighting
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public LightDistribution GetLightDistribution()
  Visual Basic
Public Function GetLightDistribution As LightDistribution
  Visual C++
public:
LightDistribution^ GetLightDistribution()
 See Also
  LightType Class
  Autodesk.Revit.DB.Lighting Namespace